# PW Data Science Masters

## Assignment - 23

In [3]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

ANS. 1. pd.DataFrame() : It is used to create a new dataframe.

In [4]:
#Example:-
data = {
    'Name' : ['Prateek', 'Prashika', 'Anshika'],
    'Age': [29, 8, 28],
    'Course': ['Data Science Masters', 'Machine Learning Specialist', 'Artificial Intelligence Expert']
}
pd.DataFrame(data)

       Name  Age                          Course
0   Prateek   29            Data Science Masters
1  Prashika    8     Machine Learning Specialist
2   Anshika   28  Artificial Intelligence Expert

2. pd.read_csv(): It is used to read a csv file in pandas

In [5]:
#Example:-
d = pd.read_csv('Unemployment_Rate_upto_11_2020.csv')
d

,Region,Date,Frequency,Estimated Unemployment Rate (%),Estimated Employed,Estimated Labour Participation Rate (%),Region.1,longitude,latitude
0,Andhra Pradesh,31-01-2020,M,5.48,16635535,41.02,South,15.9129,79.740
1,Andhra Pradesh,29-02-2020,M,5.83,16545652,40.90,South,15.9129,79.740
2,Andhra Pradesh,31-03-2020,M,5.79,15881197,39.18,South,15.9129,79.740
3,Andhra Pradesh,30-04-2020,M,20.51,11336911,33.10,South,15.9129,79.740
4,Andhra Pradesh,31-05-2020,M,17.43,12988845,36.46,South,15.9129,79.740
...,...,...,...,...,...,...,...,...,...
262,West Bengal,30-06-2020,M,7.29,30726310,40.39,East,22.9868,87.855
263,West Bengal,31-07-2020,M,6.83,35372506,46.17,East,22.9868,87.855
264,West Bengal,31-08-2020,M,14.87,33298644,47.48,East,22.9868,87.855
265,West Bengal,30-09-2020,M,9.35,35707239,47.73,East,22.9868,87.855
266,West Bengal,31-10-2020,M,9.98,33962549,45.63,East,22.9868,87.855

3. The describe() method:- It returns description of the data in the DataFrame.

In [6]:
#Example:-
d.describe()

,Estimated Unemployment Rate (%),Estimated Employed,Estimated Labour Participation Rate (%),longitude,latitude
count,267.000000,2.670000e+02,267.000000,267.000000,267.000000
mean,12.236929,1.396211e+07,41.681573,22.826048,80.532425
std,10.803283,1.336632e+07,7.845419,6.270731,5.831738
min,0.500000,1.175420e+05,16.770000,10.850500,71.192400
25%,4.845000,2.838930e+06,37.265000,18.112400,76.085600
50%,9.650000,9.732417e+06,40.390000,23.610200,79.019300
75%,16.755000,2.187869e+07,44.055000,27.278400,85.279900
max,75.850000,5.943376e+07,69.690000,33.778200,92.937600

4. The duplicated() method:- It returns a Boolean values for each row whether it contain value or not.

In [7]:
#Example:-
d.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
262    False
263    False
264    False
265    False
266    False
Length: 267, dtype: bool

5. The isnull() method:- It returns a DataFrame object where all the values are replaced with a Boolean value True for NULL values, and otherwise False.

In [8]:
#Example:-
d.isnull()

,Region,Date,Frequency,Estimated Unemployment Rate (%),Estimated Employed,Estimated Labour Participation Rate (%),Region.1,longitude,latitude
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
262,False,False,False,False,False,False,False,False,False
263,False,False,False,False,False,False,False,False,False
264,False,False,False,False,False,False,False,False,False
265,False,False,False,False,False,False,False,False,False
266,False,False,False,False,False,False,False,False,False

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data = {
    'A' : ['Prateek', 'Prashika', 'Anshika'],
    'B': [29, 8, 28],
    'C': ['Data Science Masters', 'Machine Learning Specialist', 'Artificial Intelligence Expert']
}
df = pd.DataFrame(data)

In [10]:
df.reindex([1,2,3])

          A     B                               C
1  Prashika   8.0     Machine Learning Specialist
2   Anshika  28.0  Artificial Intelligence Expert
3       NaN   NaN                             NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.

    
 For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60.

In [11]:
def sum_series(df):
    sum = df.iloc[:3].sum()
    return sum

In [12]:
data = {'Values' : [10, 20, 30, 40 ,50]}
df = pd.DataFrame(data)
print(sum_series(df))

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [13]:
def count_words(df):
    c = len(df)
    return c

In [14]:
data = {'Text' : ['My', 'name', 'is', 'Prateek', 'Singh', 'I', 'am', 'a', 'Data', 'Scientist']}
df = pd.DataFrame(data)
print(count_words(df))

10

 Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans. DataFrame.size:- it is used to return number_row*number_column

In [15]:
#Example:-
data = {
    'A' : ['Prateek', 'Prashika', 'Anshika'],
    'B': [29, 8, 28],
    'C': ['Data Science Masters', 'Machine Learning Specialist', 'Artificial Intelligence Expert']
}
df1 = pd.DataFrame(data)
df1.size

9

DataFrame.shape:- it is used to return number_row,number_column

In [16]:
#Example:-
data = {
    'A' : ['Prateek', 'Prashika', 'Anshika'],
    'B': [29, 8, 28],
    'C': ['Data Science Masters', 'Machine Learning Specialist', 'Artificial Intelligence Expert']
}
df = pd.DataFrame(data)
df1.shape

(3, 3)

Q6. Which function of pandas do we use to read an excel file?

Ans. read_excel(). This function takes the file path or URL as input and returns a DataFrame, which is a two-dimensional data structure in pandas used to store and manipulate tabular data.

In [17]:
#Example:-
d = pd.read_excel('LUSID Excel - Setting up your market data.xlsx')
d.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

 Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [24]:
def create_username(df):
    df[['Username','Domains']] = df['Email'].str.split('@', expand = True)
    df.drop(df.columns[2], axis = 1, inplace = True)
    return df

In [25]:
data = {'Email' : ['prateeksingh0809@gmail.com', 'prateek2975@gmail.com', 'silentknight0809@gmail.com']}
df = pd.DataFrame(data)
print(create_username(df))

                        Email          Username
0  prateeksingh0809@gmail.com  prateeksingh0809
1       prateek2975@gmail.com       prateek2975
2  silentknight0809@gmail.com  silentknight0809

 Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows.
 For example, if df contains the following values:
 
 A   B   C
 
 0  3   5   1
 
 1  8   2   7
 
 2  6   9   4
 
 3  2   3   5
 
 4  9   1   2

  Your function should select the following rows:   A   B   C
  
 1  8   2   7
 
 4  9   1   2
 
 The function should return a new DataFrame that contains only the selected rows.

In [29]:
def create_dataframe(df):
    new_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return new_df

In [30]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df = pd.DataFrame(data, columns = ['A', 'B', 'C'])
print(create_dataframe(df))

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column.

In [32]:
def stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median, std

In [35]:
data = {'Values' : [2,3,4,5,6,7,8,9]}
df = pd.DataFrame(data)
print(stats(df))

(5.5, 5.5, 2.449489742783178)

 Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.

In [44]:
def average(df):
    df['Moving Average'] = df['Sales'].rolling(window = 7).mean().round(2)
    return df

In [45]:
import numpy as np

In [49]:
df = pd.DataFrame(pd.date_range(start = '2024-03-25', end = '2024-04-27'), columns = ['Date'])
df['Sales'] = np.random.randint(100, 1000, size = (34))
print(average(df))

         Date  Sales  Moving Average
0  2024-03-25    353             NaN
1  2024-03-26    930             NaN
2  2024-03-27    239             NaN
3  2024-03-28    756             NaN
4  2024-03-29    641             NaN
5  2024-03-30    313             NaN
6  2024-03-31    673          557.86
7  2024-04-01    906          636.86
8  2024-04-02    791          617.00
9  2024-04-03    884          709.14
10 2024-04-04    122          618.57
11 2024-04-05    661          621.43
12 2024-04-06    476          644.71
13 2024-04-07    383          603.29
14 2024-04-08    958          610.71
15 2024-04-09    787          610.14
16 2024-04-10    604          570.14
17 2024-04-11    765          662.00
18 2024-04-12    811          683.43
19 2024-04-13    320          661.14
20 2024-04-14    989          747.71
21 2024-04-15    510          683.71
22 2024-04-16    216          602.14
23 2024-04-17    721          618.86
24 2024-04-18    925          641.71
25 2024-04-19    426          586.71
26 2024-04-20    720          643.86
27 2024-04-21    841          622.71
28 2024-04-22    844          670.43
29 2024-04-23    976          779.00
30 2024-04-24    844          796.57
31 2024-04-25    921          796.00
32 2024-04-26    415          794.43
33 2024-04-27    424          752.14

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column.

 For example, if df contains the following values:

 Date
 
 0  2023-01-01
 
 1  2023-01-02
 
 2  2023-01-03
 
 3  2023-01-04
 
 4  2023-01-05
 
 Your function should create the following DataFrame:
 
 Date             Weekday
 
 0  2023-01-01     Sunday
 
 1  2023-01-02     Monday
 
 2  2023-01-03    Tuesday
 
 3  2023-01-04    Wednesday
 
 4  2023-01-05    Thursday
 
 Data Science Masters
 
 The function should return the modified DataFrame.

In [50]:
def weekday_name(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [51]:
df = pd.DataFrame(pd.date_range(start = '2024-03-25', end = '2024-04-27'), columns = ['Date'])
print(weekday_name(df))

         Date    Weekday
0  2024-03-25     Monday
1  2024-03-26    Tuesday
2  2024-03-27  Wednesday
3  2024-03-28   Thursday
4  2024-03-29     Friday
5  2024-03-30   Saturday
6  2024-03-31     Sunday
7  2024-04-01     Monday
8  2024-04-02    Tuesday
9  2024-04-03  Wednesday
10 2024-04-04   Thursday
11 2024-04-05     Friday
12 2024-04-06   Saturday
13 2024-04-07     Sunday
14 2024-04-08     Monday
15 2024-04-09    Tuesday
16 2024-04-10  Wednesday
17 2024-04-11   Thursday
18 2024-04-12     Friday
19 2024-04-13   Saturday
20 2024-04-14     Sunday
21 2024-04-15     Monday
22 2024-04-16    Tuesday
23 2024-04-17  Wednesday
24 2024-04-18   Thursday
25 2024-04-19     Friday
26 2024-04-20   Saturday
27 2024-04-21     Sunday
28 2024-04-22     Monday
29 2024-04-23    Tuesday
30 2024-04-24  Wednesday
31 2024-04-25   Thursday
32 2024-04-26     Friday
33 2024-04-27   Saturday

 Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [67]:
def check_day(df):
    df = df.loc[(df['Date'] > '2023-01-01') & (df['Date'] < '2023-01-31')]
    return df

In [73]:
df = pd.DataFrame(pd.date_range(start = '2022-12-01', end = '2023-02-28'), columns = ['Date'])
print(check_day(df))

         Date
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30

 Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported?

Ans. The first and foremost necessary library that needs to be imported is Pandas Library.

In [74]:
import pandas as pd